[
   {
      "name": "Flower Modeling via X-ray Computed Tomography",
      "session": "Siggraph 2014",
      "link": "http://www.riken.jp/brict/Ijiri/ProjTakaflower2/index.html",
      "abstract": "This paper presents a novel three dimensional (3D) flower modeling technique that utilizes an X-ray computed tomography (CT) system and real-world flowers. Although a CT system provides volume data that captures the internal structures of flowers, it is difficult to accurately segment them into regions of particular organs and model them as smooth surfaces because a flower consists of thin organs that contact one another. We thus introduce a semiautomatic modeling technique that is based on a new active contour model with energy functionals designed for flower CT. Our key idea is to approximate flower components by two important primitives, a shaft and a sheet. Based on our active contour model, we also provide novel user interfaces and a numerical scheme to fit these primitives so as to reconstruct realistic thin flower organs efficiently. To demonstrate the feasibility of our technique, we provide various flower models reconstructed from CT volumes. ",
      "video": "//www.youtube.com/embed/yD_cSRJ7Gho"
   },
   {
      "name": "Volumetric Modeling with Diffusion Surfaces",
      "link": "http://igl.ethz.ch/projects/diffusion-surfaces/",
      "session": "Siggraph Asia 2010",
      "video": "//www.youtube.com/embed/gFQKMCF2jqs",
      "abstract": "The modeling of volumetric objects is still a difficult problem. Solid texture synthesis methods enable the design of volumes with homogeneous textures, but global features such as smoothly varying colors seen in vegetables and fruits are difficult to model. In this paper, we propose a representation called diffusion surfaces (DSs) to enable modeling such objects. DSs consist of 3D surfaces with colors defined on both sides, such that the interior colors in the volume are obtained by diffusing colors from nearby surfaces. A straightforward way to compute color diffusion is to solve a volumetric Poisson equation with the colors of the DSs as boundary conditions, but it requires expensive volumetric meshing which is not appropriate for interactive modeling. We therefore propose to interpolate colors only locally at user-defined cross-sections using a modified version of the positive mean value coordinates algorithm to avoid volumetric meshing. DSs are generally applicable to model many different kinds of objects with internal structures. As a case study, we present a simple sketch-based interface for modeling objects with rotational symmetries that can also generate random variations of models. We demonstrate the effectiveness of our approach through various DSs models with simple non-photorealistic rendering techniques enabled by DSs."
   },
   {
      "name": "3-Sweep: Extracting Editable Objects from a Single Photo",
      "link": "http://www.faculty.idc.ac.il/arik/site/3Sweep.asp",
      "session": "Siggraph 2013",
      "video": "//www.youtube.com/embed/Oie1ZXWceqM",
      "abstract": "We introduce an interactive technique for manipulating simple 3D shapes based on extracting them from a single photograph. Such extraction requires understanding of the components of the shape, their projections, and relations. These simple cognitive tasks for humans are particularly difficult for automatic algorithms. Thus, our approach combines the cognitive abilities of humans with the computational accuracy of the machine to solve this problem. Our technique provides the user the means to quickly create editable 3D parts— human assistance implicitly segments a complex object into its components, and positions them in space. In our interface, three strokes are used to generate a 3D component that snaps to the shape’s outline in the photograph, where each stroke defines one dimension of the component. The computer reshapes the component to fit the image of the object in the photograph as well as to satisfy various inferred geometric constraints imposed by its global 3D structure. We show that with this intelligent interactive modeling tool, the daunting task of object extraction is made simple. Once the 3D object has been extracted, it can be quickly edited and placed back into photos or 3D scenes, permitting object-driven photo editing tasks which are impossible to perform in image-space. We show several examples and present a user study illustrating the usefulness of our technique."
   },
   {
      "name": "Lapped Solid Textures: Filling a Model with Anisotropic Textures",
      "link": "http://people.inf.ethz.ch/~kenshit/lapped-solid-textures/lapped-solid-textures.html",
      "session": "Siggraph 2008",
      "video": "//www.youtube.com/embed/ZCLe2MF61a8",
      "abstract": "We present a method for representing solid objects with spatially-varying oriented textures by repeatedly pasting solid texture exemplars. The underlying concept is to extend the 2D texture patch-pasting approach of lapped textures to 3D solids using a tetrahedral mesh and 3D texture patches. The system places texture patches according to the user-defined volumetric tensor fields over the mesh to represent oriented textures. We have also extended the original technique to handle nonhomogeneous textures for creating solid models whose textural patterns change gradually along the depth fields. We identify several texture types considering the amount of anisotropy and spatial variation and provide a tailored user interface for each. With our simple framework, large-scale realistic solid models can be created easily with little memory and computational cost. We demonstrate the effectiveness of our approach with several examples including trees, fruits, and vegetables."
   },
   {
      "name": "Diffusion Curves: A Vector Representation for Smooth-Shaded Images",
      "link": "http://maverick.inria.fr/Publications/2008/OBWBTS08/",
      "session": "Siggraph 2008",
      "video": "//www.youtube.com/embed/lEVe7vU5WiU",
      "abstract": "We describe a new vector-based primitive for creating smooth-shaded images, called the diffusion curve. A diffusion curve partitions the space through which it is drawn, defining different colors on either side. These colors may vary smoothly along the curve. In addition, the sharpness of the color transition from one side of the curve to the other can be controlled. Given a set of diffusion curves, the final image is constructed by solving a Poisson equation whose constraints are specified by the set of gradients across all diffusion curves. Like all vector-based primitives, diffusion curves conveniently support a variety of operations, including geometry-based editing, keyframe animation, and ready stylization. Moreover, their representation is compact and inherently resolution-independent. We describe a GPU-based implementation for rendering images defined by a set of diffusion curves in realtime. We then demonstrate an interactive drawing system for allowing artists to create artworks using diffusion curves, either by drawing the curves in a freehand style, or by tracing existing imagery. The system is simple and intuitive: we show results created by artists after just a few minutes of instruction. Furthermore, we describe a completely automatic conversion process for taking an image and turning it into a set of diffusion curves that closely approximate the original image content."
   },
   {
      "name": "A procedural method for modeling the Purkinje fibers of the heart",
      "link": "http://www.riken.jp/brict/Ijiri/ProjPurkinje/index.html",
      "session": "The Journal of Physiological Science",
      "video": "//www.youtube.com/embed/lJK99478cwg",
      "abstract": "The Purkinje fibers are located in the ventricular walls of the heart, just beneath the endocardium and conduct excitation from the right and left bundle branches to the ventricular myocardium. Recently, anatomists succeeded in photographing the Purkinje fibers of a sheep, which clearly showed the mesh structure of the Purkinje fibers. In this study, we present a technique for modeling the mesh structure of Purkinje fibers semiautomatically using an extended L-system.  The L-system is a formal grammar that defines the growth of a fractal structure by generating rules (or rewriting rules) and an initial structure. It was originally formulated to describe the growth of plant cells, and has subsequently been applied for various purposes in computer graphics such as modeling plants, buildings, streets, and ornaments. For our purpose, we extended the growth process of the Lsystem as follows: 1) each growing branch keeps away from existing branches as much as possible to create a uniform distribution, and 2) when branches collide, we connect the colliding branches to construct a closed mesh structure. We designed a generating rule based on observations of the photograph of Purkinje fibers and manually specified three terminal positions on a three-dimensional (3D) heart model: those of the right bundle branch, the anterior fascicle, and the left posterior fascicle of the left branch. Then, we grew fibers starting from each of the three positions based on the specified generating rule.  We achieved to generate 3D models of Purkinje fibers of which physical appearances closely resembled the real photograph. The generation takes a few seconds. Variations of the Purkinje fibers could be constructed easily by modifying the generating rules and parameters."
   },
   {
      "name": "Dual-Color Mixing for Fused Deposition Modeling Printers",
      "link": "http://cg.ivd.kit.edu/publications/2014/DCM/DualColorMixing.pdf",
      "session": "Eurographics 2014",
      "abstract": "In this work we detail a method that leverages the two color heads of recent low-end fused deposition modeling (FDM) 3D printers to produce continuous tone imagery. The challenge behind producing such two-tone imagery is how to finely interleave the two colors while minimizing the switching between print heads, making each color printed span as long and continuous as possible to avoid artifacts associated with printing short segments. The key insight behind our work is that by applying small geometric offsets, tone can be varied without the need to switch color print heads within a single layer. We can now effectively print (two-tone) texture mapped models capturing both geometric and color information in our output 3D prints."
   }
]